# config.pbtxt
name: "postprocessing2"                                                  
backend: "python"                                          
                                                        
input [                                                                  
  {                                                                      
    name: "table_bbox"                                                       
    data_type: TYPE_FP32                                              
    dims: [-1, 4]                                                          
  },
  {                                                                      
    name: "table_execute_signal"                                                      
    data_type: TYPE_FP32                                              
    dims: [1]                                                      
  },   
  {                                                                      
    name: "raw_input_image"                                                       
    data_type: TYPE_STRING                                               
    dims: [1]                                                          
  }


]                                                                        

output [                                                                 
    {                                                                      
    name: "preprocessed_table"                                                      
    data_type: TYPE_FP32                                               
    dims: [-1, 3, 480, 480]                                                        
    },
    {                                                                      
      name: "nw"                                                      
      data_type: TYPE_FP32                                            
      dims: [-1]                                                        
    },
    {                                                                      
      name: "nh"                                                      
      data_type: TYPE_FP32                                               
      dims: [-1]                                                        
    },
    {                                                                      
      name: "oriw"                                                      
      data_type: TYPE_FP32                                              
      dims: [-1]                                                        
    },
    {                                                                      
      name: "orih"                                                      
      data_type: TYPE_FP32                                              
      dims: [-1]                                                      
    }                
]        

parameters: {
    key: "EXECUTION_ENV_PATH", 
    value: {string_value: "/models/240117_env.tar.gz"}
}

instance_group [
    {
        kind: KIND_CPU
    }
]