name: "recognition"
platform: "onnxruntime_onnx"

input [
    {
        name: "input"
        data_type: TYPE_FP32
        dims: [-1, 3, 32, 128] 
    }
]

output [
    {
        name: "output"
        data_type: TYPE_FP32
        dims: [-1,-1,-1]
    }
]

instance_group [
    {
        kind: KIND_GPU
    }
]