# config.pbtxt
name: "midprocessing"                                                  
backend: "python"                                          
                                                        
input [                                                                  
  {                                                                      
    name: "detection_result"                                                       
    data_type: TYPE_FP32                                               
    dims: [-1,-1,-1]                                                        
  },
  {                                                                      
    name: "padded_image"                                                       
    data_type: TYPE_FP32                                               
    dims: [1, 3, 1280, 1280]                                                       
  },
  {
    name: "raw_image"
    data_type: TYPE_STRING
    dims: [1]
  },
  {
    name: "ratio"
    data_type: TYPE_FP32
    dims: [2]
  }              
]                                                                        

output [                                                                 
  {                                                                      
    name: "input_image_show"                                                      
    data_type: TYPE_FP32                                                  
    dims: [1, 3, -1, -1]                                                    
  },

  {                                                                      
    name: "cropped_images"                                                     
    data_type: TYPE_FP32                                                     
    dims: [-1, 3, 32, 128]                                                    
  },

  {                                                                      
    name: "bboxes"                                                     
    data_type: TYPE_FP32                                                     
    dims: [1, -1, 4]                                                    
  },

  {                                                                      
    name: "recognition_flag"                                                     
    data_type: TYPE_FP32                                                     
    dims: [1]                                                    
  }                                                                                      
]        

parameters: {
    key: "EXECUTION_ENV_PATH", 
    value: {string_value: "/models/240117_env.tar.gz"}
}

instance_group [
    {
        kind: KIND_CPU
    }
]