name: "detection"
platform: "onnxruntime_onnx"

input [
    {
        name: "images"
        data_type: TYPE_FP32
        dims: [1,3,1280,1280]
    }
]

output [
    {
        name: "output0"
        data_type: TYPE_FP32
        dims: [-1,-1,-1]
    }
]

instance_group [
    {
        kind: KIND_GPU
    }
]