# config.pbtxt
name: "postprocessing1"                                                  
backend: "python"                                          
                                                        
input [                                                                  
  {                                                                      
    name: "recognition_result"                                                       
    data_type: TYPE_FP32                                               
    dims: [-1, 27, 11267]                                                       
  },
  {                                                                      
    name: "recognition_flag_pp"                                                       
    data_type: TYPE_FP32                                               
    dims: [1]                                                       
  },
  {                                                                      
    name: "raw_image"
    data_type: TYPE_STRING
    dims: [1]                                                 
  },
  {                                                                      
    name: "bboxes"                                                     
    data_type: TYPE_FP32                                                     
    dims: [1, -1, 4]                                                       
  },
  {                                                                      
    name: "pred_box"                                                     
    data_type: TYPE_FP32                                                     
    dims: [-1,-1]                                                       
  },
  {
    name: "pred_class"
    data_type: TYPE_INT64
    dims: [-1]
  },
  {
    name: "ratio_dla"                                                      
    data_type: TYPE_FP32                                               
    dims: [2]        
  }


]                                                                        

output [                                                                 
  {                                                                      
    name: "image_result"                                                       
    data_type: TYPE_STRING                                              
    dims: [1]                                                    
  },    
  {                                                                      
    name: "text_result"                                                       
    data_type: TYPE_STRING                                                
    dims: [-1,-1]                                                    
  },
  {                                                                      
    name: "table_result"                                                       
    data_type: TYPE_FP32                                                
    dims: [-1,4]                                                    
  },
  {                                                                      
    name: "figure_result"                                                       
    data_type: TYPE_FP32                                               
    dims: [-1,4]                                                    
  },
  {                                                                      
    name: "table_flag"                                                       
    data_type: TYPE_FP32                                                
    dims: [1]                                                    
  }                                    
]    

parameters: {
    key: "EXECUTION_ENV_PATH", 
    value: {string_value: "/models/240117_env.tar.gz"}
}

instance_group [
    {
        kind: KIND_CPU
    }
]