name: "tr_model"
platform: "onnxruntime_onnx"

input [
    {
        name: "tr_input"
        data_type: TYPE_FP32
        dims: [-1, 3, 480 , 480]
    }
]

output [
    {
        name: "tr_output1"
        data_type: TYPE_FP32
        dims: [-1,-1,-1]
    },
    {
        name: "tr_output2"
        data_type: TYPE_FP32
        dims: [-1,-1,-1]
    }
]

instance_group [
    {
        kind: KIND_GPU
    }
]